Repository: ViniR-RB/hello_multlan_mobile
Catalog: lib/l10n/app_*.arb
Languages: pt

source: networkError
pt: Sem conexão com a internet.

# invalidCredentials
source: E-mail or password is invalid.
pt: E-mail ou senha inválidos.

source: unknownError
pt: Algo deu errado.

# localStorageNotFoundKey
source: The key was not found in local storage.
pt: A chave não foi encontrada no armazenamento local.

# unauthorized
source: User is not authorized.
pt: Usuário não autorizado.

# successInLogin
source: Login successful.
pt: Login realizado com sucesso.

# locationServiceDisabled
source: Location services are disabled. Please enable them in your device settings.
pt: O serviço de localização está desativado. Por favor, ative-o nas configurações do seu dispositivo.

# locationPermissionDenied
source: Location permission denied. Please grant permission to access your location.
pt: Permissão de localização negada. Por favor, conceda permissão para acessar sua localização.

# locationPermissionDeniedForever
source: Location permission denied permanently. Please enable it in your device settings.
pt: Permissão de localização negada permanentemente. Por favor ative-a nas configurações do seu dispositivo.

# imagePickerNotFound
source: No image selected
pt: Nenhuma imagem foi selecionada

# cameraAccessDenied
source: Adjust as camera settings to allow access to it
pt: Ajuste as permissões de acesso à galeria de celulares para continuar

# photoAccessDenied
source: Adjust cell phone gallery access permissions to continue
pt: Ajuste as permissoes de acesso a galeria do celular para continuar

# timeout
source: Time Exceeded in this operation
pt: Tempo excedido nessa operação

# successInCreateBox
source: Create Box Successfully
pt: Criação da Caixa foi um sucesso

# noteMinLength
source: Note must be at least 3 characters long
pt: A anotação deve ter pelo menos 3 caracteres

# filledSpaceGreaterThanFreeSpace
source: Filled space not greater than free space
pt: Quantidade do espaco preenchido nao pode ser maio que a quantidade de espaço livre

# fieldRequired
source: Field is required
pt: Campo é requerido

# mapNotLoading
source: We are having trouble loading the map, try recently later
pt: Estamos com problema de carregar o mapa, tente recentemente mais tarde
